STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP215F-DK/stm32mp215f_disco_lcd.c
/**
  ******************************************************************************
  * @file    stm32mp215f_disco_lcd.c
  * @author  MCD Application Team
  * @brief   This file includes the driver for Liquid Crystal Display (LCD) module
  *          mounted on STM32MP215F-DK board.
  @verbatim
  1. How To use this driver:
  --------------------------
     - This driver is used to drive directly an LCD TFT using the LTDC controller.
     - This driver uses timing and setting for RK043FN48H LCD.

  2. Driver description:
  ---------------------
    + Initialization steps:
       o Initialize the LCD using the BSP_LCD_Init() function.
       o Apply the Layer configuration using the BSP_LCD_LayerDefaultInit() function.
       o Select the LCD layer to be used using the BSP_LCD_SelectLayer() function.
       o Enable the LCD display using the BSP_LCD_DisplayOn() function.

    + Options
       o Configure and enable the color keying functionality using the
         BSP_LCD_SetColorKeying() function.
       o Modify in the fly the transparency and/or the frame buffer address
         using the following functions:
         - BSP_LCD_SetTransparency()
         - BSP_LCD_SetLayerAddress()
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Dependencies
- stm32mp215f_disco.c
- stm32mp2xx_hal_ltdc.c
- stm32mp2xx_hal_ltdc_ex.c
- stm32mp2xx_hal_rcc_ex.c
- stm32mp2xx_hal_gpio.c
- rk043fn48h.h
- fonts.h
- font24.c
- font20.c
- font16.c
- font12.c
- font8.c"
EndDependencies */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp215f_disco_lcd.h"


/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32MP2XX_DISCO
  * @{
  */

/** @addtogroup STM32MP2XX_DISCO_LCD
  * @{
  */

/** @defgroup STM32MP2XX_DISCO_LCD_Private_TypesDefinitions STM32MP2XX_DISCO_LCD Private Types Definitions
  * @{
  */
const LCD_UTILS_Drv_t LCD_Driver =
{
  BSP_LCD_DrawBitmap,
  BSP_LCD_FillRGBRect,
  BSP_LCD_DrawHLine,
  BSP_LCD_DrawVLine,
  BSP_LCD_FillRect,
  BSP_LCD_ReadPixel,
  BSP_LCD_WritePixel,
  BSP_LCD_GetXSize,
  BSP_LCD_GetYSize,
  BSP_LCD_SelectLayer,
  BSP_LCD_GetPixelFormat

};
/**
  * @}
  */
/** @defgroup STM32MP2XX_DISCO_LCD_Private_Defines STM32MP2XX_DISCO LCD Private Defines
  * @{
  */
#define POLY_X(Z)              ((int32_t)((Points + Z)->X))
#define POLY_Y(Z)              ((int32_t)((Points + Z)->Y))
#define PIXEL_PER_LINE         (480*2)
#define ALPHA_VALUE             255
/**
  * @}
  */

/** @defgroup STM32MP2XX_DISCO_LCD_Private_Macros STM32MP2XX_DISCO_LCD Private Macros
  * @{
  */
#define ABS(X)  ((X) > 0 ? (X) : -(X))
/**
  * @}
  */

/** @defgroup STM32MP2XX_DISCO_LCD_Private_Variables STM32MP2XX_DISCO_LCD Private Variables
  * @{
  */
LTDC_HandleTypeDef  hLtdcHandler;

/* Default LCD configuration with LCD Layer 1 */
static uint32_t            ActiveLayer = 0;
static LCD_DrawPropTypeDef DrawProp[MAX_LAYER_NUMBER];
/**
  * @}
  */

/** @defgroup STM32MP2XX_DISCO_LCD_Private_FunctionPrototypes STM32MP2XX_DISCO_LCD Private Function Prototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup STM32MP2XX_DISCO_LCD_Exported_Functions STM32MP2XX_DISCO_LCD Exported Functions
  * @{
  */

/**
  * @brief  Initializes the LCD.
  * @param  Instance    LCD Instance
  * @retval LCD state
  */
int32_t BSP_LCD_Init(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {

    /* DeInit */
    if (HAL_LTDC_DeInit(&hLtdcHandler) != HAL_OK)
    {
      return LCD_ERROR;
    }

    /* Select the used LCD */

    /* The RK043FN48H LCD 480x272 is selected */
    /* Timing Configuration */
    hLtdcHandler.Init.HorizontalSync = (RK043FN48H_HSYNC - (uint16_t)1);
    hLtdcHandler.Init.VerticalSync = (RK043FN48H_VSYNC - (uint16_t)1);
    hLtdcHandler.Init.AccumulatedHBP = (RK043FN48H_HSYNC + RK043FN48H_HBP - (uint16_t)1);
    hLtdcHandler.Init.AccumulatedVBP = (RK043FN48H_VSYNC + RK043FN48H_VBP - (uint16_t)1);
    hLtdcHandler.Init.AccumulatedActiveH = (RK043FN48H_HEIGHT + RK043FN48H_VSYNC + RK043FN48H_VBP - (uint16_t)1);
    hLtdcHandler.Init.AccumulatedActiveW = (RK043FN48H_WIDTH + RK043FN48H_HSYNC + RK043FN48H_HBP - (uint16_t)1);
    hLtdcHandler.Init.TotalHeigh = (RK043FN48H_HEIGHT + RK043FN48H_VSYNC + RK043FN48H_VBP +
                                    RK043FN48H_VFP - (uint16_t)1);
    hLtdcHandler.Init.TotalWidth = (RK043FN48H_WIDTH + RK043FN48H_HSYNC + RK043FN48H_HBP +
                                    RK043FN48H_HFP - (uint16_t)1);

    /* LCD clock configuration */
    BSP_LCD_ClockConfig(&hLtdcHandler, NULL);

    /* Initialize the LCD pixel width and pixel height */
    hLtdcHandler.LayerCfg->ImageWidth  = RK043FN48H_WIDTH;
    hLtdcHandler.LayerCfg->ImageHeight = RK043FN48H_HEIGHT;

    /* Background value */
    hLtdcHandler.Init.Backcolor.Blue = 0;
    hLtdcHandler.Init.Backcolor.Green = 0;
    hLtdcHandler.Init.Backcolor.Red = 0;

    /* Polarity */
    hLtdcHandler.Init.HSPolarity = LTDC_HSPOLARITY_AL;
    hLtdcHandler.Init.VSPolarity = LTDC_VSPOLARITY_AL;
    hLtdcHandler.Init.DEPolarity = LTDC_DEPOLARITY_AL;
    hLtdcHandler.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
    hLtdcHandler.Instance = LTDC;

    if (HAL_LTDC_GetState(&hLtdcHandler) == HAL_LTDC_STATE_RESET)
    {
      /* Initialize the LCD Msp: this __weak function can be rewritten by the application */
      BSP_LCD_MspInit(&hLtdcHandler, NULL);
    }
    if (HAL_LTDC_Init(&hLtdcHandler) != HAL_OK)
    {
      return LCD_ERROR;
    }

  }

  return ret;
}

/**
  * @brief  DeInitializes the LCD.
  * @param  Instance    LCD Instance
  * @retval LCD state
  */
int32_t BSP_LCD_DeInit(uint32_t Instance)
{

  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Initialize the hLtdcHandler Instance parameter */
    hLtdcHandler.Instance = LTDC;

