STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP215F-DK/stm32mp215f_disco_lcd.c
    /* Disable LTDC block */
    __HAL_LTDC_DISABLE(&hLtdcHandler);

    /* DeInit the LTDC */
    if (HAL_LTDC_DeInit(&hLtdcHandler) != HAL_OK)
    {
      return LCD_ERROR;
    }

    /* DeInit the LTDC MSP : this __weak function can be rewritten by the application */
    BSP_LCD_MspDeInit(&hLtdcHandler, NULL);
  }
  return ret;
}

/**
  * @brief  Gets the LCD X size.
  * @param  Instance LCD Instance
  * @retval XSize pointer Used LCD X size
  */
int32_t BSP_LCD_GetXSize(uint32_t Instance, uint32_t *XSize)
{

  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    *XSize = hLtdcHandler.LayerCfg[ActiveLayer].ImageWidth;
  }

  return ret;
}

/**
  * @brief  Gets the LCD Y size.
  * @param  Instance LCD Instance
  * @retval YSize pointer Used LCD Y size
  */
int32_t BSP_LCD_GetYSize(uint32_t Instance, uint32_t *YSize)
{

  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    *YSize = hLtdcHandler.LayerCfg[ActiveLayer].ImageHeight;
  }

  return ret;
}

/**
  * @brief  Set the LCD X size.
  * @param  Instance    LCD Instance
  * @param  imageWidthPixels : image width in pixels unit
  * @retval None
  */
int32_t BSP_LCD_SetXSize(uint32_t Instance, uint32_t imageWidthPixels)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    hLtdcHandler.LayerCfg[ActiveLayer].ImageWidth = imageWidthPixels;
  }
  return ret;
}

/**
  * @brief  Set the LCD Y size.
  * @param  Instance    LCD Instance
  * @param  imageHeightPixels : image height in lines unit
  * @retval None
  */
int32_t BSP_LCD_SetYSize(uint32_t Instance, uint32_t imageHeightPixels)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    hLtdcHandler.LayerCfg[ActiveLayer].ImageHeight = imageHeightPixels;
  }
  return ret;

}

/**
  * @brief  Initializes the LCD layer in ARGB8888 format (32 bits per pixel).
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer foreground or background
  * @param  FB_Address: Layer frame buffer
  * @retval None
  */
int32_t BSP_LCD_LayerDefaultInit(uint32_t Instance, uint16_t LayerIndex, uint32_t FB_Address)
{

  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    LCD_LayerCfgTypeDef  layer_cfg;
    /* Layer Init */
    BSP_LCD_GetLTDCPixelFormat(0, LCD_PIXEL_FORMAT_ARGB8888, &layer_cfg.PixelFormat);
    layer_cfg.WindowX0 = 0;
    BSP_LCD_GetXSize(0, &layer_cfg.WindowX1);
    layer_cfg.WindowY0 = 0;
    BSP_LCD_GetYSize(0, &layer_cfg.WindowY1);
    layer_cfg.FBStartAdress = FB_Address;
    layer_cfg.Alpha = ALPHA_VALUE;
    layer_cfg.Alpha0 = 0;
    layer_cfg.Backcolor.Blue = 0;
    layer_cfg.Backcolor.Green = 0;
    layer_cfg.Backcolor.Red = 0;
    layer_cfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
    layer_cfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
    BSP_LCD_GetXSize(0, &layer_cfg.ImageWidth);
    BSP_LCD_GetYSize(0, &layer_cfg.ImageHeight);
    layer_cfg.HorMirrorEn = 0;
    layer_cfg.VertMirrorEn = 0;

    if (HAL_LTDC_ConfigLayer(&hLtdcHandler, &layer_cfg, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }

    if (HAL_LTDC_ProgramLineEvent(&hLtdcHandler, BSP_LCD_GetYSize(0, &layer_cfg.ImageHeight) / (uint32_t)2) != HAL_OK)
    {
      return LCD_ERROR;
    }

    DrawProp[LayerIndex].BackColor = LCD_COLOR_WHITE;
    DrawProp[LayerIndex].TextColor = LCD_COLOR_BLACK;
  }

  return ret;
}

/**
  * @brief  Initializes the LCD layer in RGB565 format (16 bits per pixel).
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer foreground or background
  * @param  FB_Address: Layer frame buffer
  * @retval None
  */
int32_t BSP_LCD_LayerRgb565Init(uint32_t Instance, uint16_t LayerIndex, uint32_t FB_Address)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    LCD_LayerCfgTypeDef  layer_cfg;
    /* Layer Init */
    BSP_LCD_GetLTDCPixelFormat(0, LCD_PIXEL_FORMAT_RGB565, &layer_cfg.PixelFormat);
    layer_cfg.WindowX0 = 0;
    BSP_LCD_GetXSize(0, &layer_cfg.WindowX1);
    layer_cfg.WindowY0 = 0;
    BSP_LCD_GetYSize(0, &layer_cfg.WindowY1);
    layer_cfg.FBStartAdress = FB_Address;
    layer_cfg.Alpha = ALPHA_VALUE;
    layer_cfg.Alpha0 = 0;
    layer_cfg.Backcolor.Blue = 0;
    layer_cfg.Backcolor.Green = 0;
    layer_cfg.Backcolor.Red = 0;
    layer_cfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
    layer_cfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
    BSP_LCD_GetXSize(0, &layer_cfg.ImageWidth);
    BSP_LCD_GetYSize(0, &layer_cfg.ImageHeight);
    layer_cfg.HorMirrorEn = 0;
    layer_cfg.VertMirrorEn = 0;
    if (HAL_LTDC_ConfigLayer(&hLtdcHandler, &layer_cfg, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }

    DrawProp[LayerIndex].BackColor = LCD_COLOR_WHITE;
    DrawProp[LayerIndex].TextColor = LCD_COLOR_BLACK;
  }
  return  ret;
}

/**
  * @brief  Selects the LCD Layer.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer foreground or background
  * @retval None
  */
int32_t BSP_LCD_SelectLayer(uint32_t Instance, uint32_t LayerIndex)
{
  uint32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    ActiveLayer = LayerIndex;
  }
  return ret;
}

/**
  * @brief  Sets an LCD Layer visible
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Visible Layer
  * @param  State: New state of the specified layer
  *          This parameter can be one of the following values:
  *            @arg  ENABLE
  *            @arg  DISABLE
  * @retval None
  */
int32_t BSP_LCD_SetLayerVisible(uint32_t Instance, uint32_t LayerIndex, FunctionalState State)
{
  uint32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (State == ENABLE)
    {
      __HAL_LTDC_LAYER_ENABLE(&hLtdcHandler, LayerIndex);
    }
    else
    {
      __HAL_LTDC_LAYER_DISABLE(&hLtdcHandler, LayerIndex);
    }
    __HAL_LTDC_RELOAD_IMMEDIATE_CONFIG(&hLtdcHandler);
  }
  return ret;
}

/**
  * @brief  Sets an LCD Layer visible without reloading.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Visible Layer
  * @param  State: New state of the specified layer
  *          This parameter can be one of the following values:
  *            @arg  ENABLE
  *            @arg  DISABLE
  * @retval None
  */
int32_t BSP_LCD_SetLayerVisible_NoReload(uint32_t Instance, uint32_t LayerIndex, FunctionalState State)
{
  uint32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (State == ENABLE)
    {
      __HAL_LTDC_LAYER_ENABLE(&hLtdcHandler, LayerIndex);
    }
    else
    {
      __HAL_LTDC_LAYER_DISABLE(&hLtdcHandler, LayerIndex);
    }
  }
  return ret;
  /* Do not Sets the Reload  */
}

/**
  * @brief  Gets the LCD Active LCD Pixel Format.
  * @param  Instance    LCD Instance
  * @param  PixelFormat Active LCD Pixel Format
  * @retval BSP status
  */
int32_t BSP_LCD_GetPixelFormat(uint32_t Instance, uint32_t *PixelFormat)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint32_t LCDPixelFormat;
    BSP_LCD_GetLCDPixelFormat(Instance, hLtdcHandler.LayerCfg[Instance].PixelFormat, &LCDPixelFormat);
    *PixelFormat = LCDPixelFormat;
  }

  return ret;
}
/**
  * @brief  Gets the LCD Active LTDC Pixel Format.
  * @param  Instance    LCD Instance
  * @param  PixelFormat Active LCD Pixel Format
  * @param  LTDCPixelFormat Pointer to Active LTDC Pixel Format
  * @retval BSP status
  */
int32_t BSP_LCD_GetLTDCPixelFormat(uint32_t Instance, uint32_t PixelFormat, uint32_t *LTDCPixelFormat)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {

