STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP215F-DK/stm32mp215f_disco_lcd.c
    GPIO_Init_Structure.Mode      = GPIO_MODE_OUTPUT_PP;
    GPIO_Init_Structure.Pull      = GPIO_NOPULL;
    GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_MEDIUM;
    GPIO_Init_Structure.Pin       = LCD_DISP_CTRL_PIN; /* BL_CTRL */
    HAL_GPIO_Init(LCD_DISP_CTRL_GPIO_PORT, &GPIO_Init_Structure);

    /* Assert LCD_DISP_EN pin */
    HAL_GPIO_WritePin(LCD_DISP_CTRL_GPIO_PORT, LCD_DISP_CTRL_PIN, GPIO_PIN_SET);

    /* re-connect the BL pin to the brightness TIMER */
    GPIO_Init_Structure.Mode      = GPIO_MODE_OUTPUT_PP;
    GPIO_Init_Structure.Pull      = GPIO_NOPULL;
    GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_MEDIUM;
    GPIO_Init_Structure.Alternate = GPIO_AF7_TIM2;
    GPIO_Init_Structure.Pin       = LCD_BL_CTRL_PIN; /* BL_CTRL */
    HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &GPIO_Init_Structure);

    HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_SET);

    /* Display On */
    __HAL_LTDC_ENABLE(&hLtdcHandler);
  }
  return ret;
}

/**
  * @brief  Disables the display.
  * @param  Instance    LCD Instance
  * @retval None
  */
int32_t BSP_LCD_DisplayOff(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;
  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    GPIO_InitTypeDef GPIO_Init_Structure;

    GPIO_Init_Structure.Mode      = GPIO_MODE_OUTPUT_PP;
    GPIO_Init_Structure.Pull      = GPIO_NOPULL;
    GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_MEDIUM;
    GPIO_Init_Structure.Pin       = LCD_DISP_CTRL_PIN; /* DISP_CTRL */
    HAL_GPIO_Init(LCD_DISP_CTRL_GPIO_PORT, &GPIO_Init_Structure);

    /* Assert LCD_DISP_EN pin */
    HAL_GPIO_WritePin(LCD_DISP_CTRL_GPIO_PORT, LCD_DISP_CTRL_PIN, GPIO_PIN_RESET);

    /* re-connect the BL pin to the brightness TIMER */
    GPIO_Init_Structure.Mode      = GPIO_MODE_OUTPUT_PP;
    GPIO_Init_Structure.Pull      = GPIO_NOPULL;
    GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_MEDIUM;
    GPIO_Init_Structure.Alternate = GPIO_AF7_TIM2;
    GPIO_Init_Structure.Pin       = LCD_BL_CTRL_PIN; /* BL_CTRL */
    HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &GPIO_Init_Structure);

    HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_RESET);

    /* Display Off */
    __HAL_LTDC_DISABLE(&hLtdcHandler);
  }
  return ret;
}

/**
  * @brief  Draw a horizontal line on LCD.
  * @param  Instance LCD Instance.
  * @param  Xpos X position.
  * @param  Ypos Y position.
  * @param  pData Pointer to RGB line data
  * @param  Width Rectangle width.
  * @param  Height Rectangle Height.
  * @retval BSP status.
  */
int32_t BSP_LCD_FillRGBRect(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint8_t *pData, uint32_t Width,
                            uint32_t Height)
{
  int32_t ret = BSP_ERROR_NONE;
  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint32_t Xaddress;
    uint32_t StartAddress;
    uint32_t i;
    uint32_t j;
    uint32_t LCDPixelFormat;

    BSP_LCD_GetPixelFormat(Instance, &LCDPixelFormat);

    if (LCDPixelFormat == LCD_PIXEL_FORMAT_RGB565)
    {
      /* Set the start address */
      StartAddress = (hLtdcHandler.LayerCfg[Instance].FBStartAdress);
      StartAddress = StartAddress + (2 * (Ypos * (hLtdcHandler.LayerCfg[Instance].ImageWidth) + Xpos));

      /* Fill the rectangle */
      for (i = 0; i < Height; i++)
      {
        Xaddress =  StartAddress + (PIXEL_PER_LINE * i);
        for (j = 0; j < Width; j++)
        {
          *(__IO uint16_t *)(Xaddress)  = *(uint16_t *)(pData + (2U * j));
          Xaddress += 2U;
        }
      }
    }
    else if (LCDPixelFormat == LCD_PIXEL_FORMAT_ARGB8888)
    {
      /* Set the start address */
      StartAddress = (hLtdcHandler.LayerCfg[Instance].FBStartAdress);
      StartAddress = StartAddress + (4 * (Ypos * (hLtdcHandler.LayerCfg[Instance].ImageWidth) + Xpos));


      /* Fill the rectangle */
      for (i = 0; i < Height; i++)
      {
        Xaddress =  StartAddress + (2 * PIXEL_PER_LINE * i);
        for (j = 0; j < Width; j++)
        {
          *(__IO uint32_t *)(Xaddress)  = *(uint32_t *)(pData + (4U * j));
          Xaddress += 4U;
        }
      }
    }
    /* Flushing cache*/
#if defined(CACHE_USE)
    L1C_CleanInvalidateDCacheAll();
#endif /* CACHE_USE */
  }
  return ret;
}

/**
  * @brief  Draws a full rectangle in currently active layer.
  * @param  Instance   LCD Instance
  * @param  Xpos X position
  * @param  Ypos Y position
  * @param  Width Rectangle width
  * @param  Height Rectangle height
  * @param  Color RGB color
  * @retval BSP status
  */
int32_t BSP_LCD_FillRect(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t Width, uint32_t Height,
                         uint32_t Color)
{
  int32_t ret = BSP_ERROR_NONE;
  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint32_t ref = Ypos + Height;
    /* Write line */
    while (Ypos < ref)
    {
      ret = BSP_LCD_DrawHLine(Instance, Xpos, Ypos++, Width, Color);
    }
  }
  return ret;
}

/**
  * @brief  Draws an horizontal line in currently active layer.
  * @param  Instance   LCD Instance
  * @param  Xpos  X position
  * @param  Ypos  Y position
  * @param  Length  Line length
  * @param  Color RGB color
  * @retval BSP status
  */
int32_t BSP_LCD_DrawHLine(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t Length, uint32_t Color)
{
  int32_t ret = BSP_ERROR_NONE;
  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint16_t xRef = Xpos;
    /* Write line */
    while (Xpos < Length + xRef)
    {
      ret = BSP_LCD_WritePixel(Instance, Xpos++, Ypos, Color);
    }
    /* Flushing cache*/
#if defined(CACHE_USE)
    L1C_CleanInvalidateDCacheAll();
#endif /* CACHE_USE */
  }
  return ret;
}

/**
  * @brief  Draws a vertical line in currently active layer.
  * @param  Instance   LCD Instance
  * @param  Xpos  X position
  * @param  Ypos  Y position
  * @param  Length  Line length
  * @param  Color RGB color
  * @retval BSP status
  */
int32_t BSP_LCD_DrawVLine(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t Length, uint32_t Color)
{
  int32_t ret = BSP_ERROR_NONE;
  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint16_t yRef = Ypos;

