STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP215F-DK/stm32mp215f_disco_lcd.c
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Params);
  UNUSED(hltdc);

  /* Enable the LTDC clocks */
  __HAL_RCC_LTDC_CLK_ENABLE();

  /* Enable GPIOs clock */
#if defined(USE_DEVELOPMENT_MODE)
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOI_CLK_ENABLE();
#endif /* defined(USE_DEVELOPMENT_MODE) */

  /* Request all needed GPIOs for LTDC */
  if (ResMgr_GPIO_Request(RESMGR_RESOURCE_RIF_GPIOA,
                          GPIO_PIN_1 | GPIO_PIN_7 | GPIO_PIN_10) != RESMGR_STATUS_ACCESS_OK) { Error_Handler(); }
  if (ResMgr_GPIO_Request(RESMGR_RESOURCE_RIF_GPIOF,
                          GPIO_PIN_5 | GPIO_PIN_9 | GPIO_PIN_12) != RESMGR_STATUS_ACCESS_OK) { Error_Handler(); }
  if (ResMgr_GPIO_Request(RESMGR_RESOURCE_RIF_GPIOG,
                          GPIO_PIN_2 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 |
                          GPIO_PIN_15) != RESMGR_STATUS_ACCESS_OK) { Error_Handler(); }
  if (ResMgr_GPIO_Request(RESMGR_RESOURCE_RIF_GPIOI,
                          GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_4 | GPIO_PIN_6 | GPIO_PIN_8) != RESMGR_STATUS_ACCESS_OK) { Error_Handler(); }
  if (ResMgr_GPIO_Request(RESMGR_RESOURCE_RIF_GPIOC,
                          GPIO_PIN_0 | GPIO_PIN_5 | GPIO_PIN_11) != RESMGR_STATUS_ACCESS_OK) { Error_Handler(); }
  if (ResMgr_GPIO_Request(RESMGR_RESOURCE_RIF_GPIOB, GPIO_PIN_15) != RESMGR_STATUS_ACCESS_OK) { Error_Handler(); }

  /*
   * CLK  ----> F12  (AF13)
   * HSYNC----> G2  (AF13)
   * VSYNC----> I6  (AF13)
   * DE   ----> C5  (AF14)
   *
   * R2   ----> C11  (AF13)
   * R3   ----> A1 (AF11)
   * R4   ----> B15 (AF13)
   * R5   ----> G5  (AF13)
   * R6   ----> A10 (AF12)
   * R7   ----> G7  (AF13)
   *
   * G2   ----> G8  (AF13)
   * G3   ----> G9  (AF13)
   * G4   ----> G10  (AF13)
   * G5   ----> G11  (AF13)
   * G6   ----> G12  (AF13)
   * G7   ----> C0 (AF13)
   *
   * B2   ----> G15 (AF13)
   * B3   ----> I0  (AF13)
   * B4   ----> I1  (AF13)
   * B5   ----> A7  (AF10)
   * B6   ----> F5  (AF13)
   * B7   ----> I4  (AF13)
   * */

  /*** LTDC Pins configuration ***/
  /* ('F', 12, AF13) LCD_CLK */
  GPIO_Init_Structure.Pin       = GPIO_PIN_12;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOF, &GPIO_Init_Structure);

  /* ('G', 2, AF13) LCD_HSYNC */
  GPIO_Init_Structure.Pin       = GPIO_PIN_2;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOG, &GPIO_Init_Structure);

  /* ('I',  6, AF13) LCD_VSYNC */
  GPIO_Init_Structure.Pin       = GPIO_PIN_6;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOI, &GPIO_Init_Structure);

  /* ('C',  5, AF14) LCD_DE */
  GPIO_Init_Structure.Pin       = GPIO_PIN_5;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOC, &GPIO_Init_Structure);

  /* ('C', 11, AF13) LCD_R2 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_11;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOC, &GPIO_Init_Structure);

  /* ('A', 1, AF11) LCD_R3 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_1;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF11_LCD;
  HAL_GPIO_Init(GPIOA, &GPIO_Init_Structure);

  /* ('B', 15, AF13) LCD_R4 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_15;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOB, &GPIO_Init_Structure);

  /* ('G',  5, AF13) LCD_R5 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_5;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOG, &GPIO_Init_Structure);

  /* ('A',  10, AF12) LCD_R6 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_10;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF12_LCD;
  HAL_GPIO_Init(GPIOA, &GPIO_Init_Structure);

  /* ('G',  7, AF13) LCD_R7 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_7;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOG, &GPIO_Init_Structure);

  /* ('G', 8, AF13) LCD_G2 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_8;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOG, &GPIO_Init_Structure);

  /* ('G',  9, AF13) LCD_G3 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_9;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOG, &GPIO_Init_Structure);

  /* ('G',  10, AF13) LCD_G4 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_10;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOG, &GPIO_Init_Structure);

  /* ('G',  11, AF13) LCD_G5 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_11;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOG, &GPIO_Init_Structure);

  /* ('G',  12, AF13) LCD_G6 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_12;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOG, &GPIO_Init_Structure);

  /* ('C', 0, AF13) LCD_G7 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_0;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOC, &GPIO_Init_Structure);

  /* ('G',  15, AF13) LCD_B2 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_15;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOG, &GPIO_Init_Structure);

  /* ('I',  0, AF13) LCD_B3 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_0;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOI, &GPIO_Init_Structure);

  /* ('I',  1, AF13) LCD_B4 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_1;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOI, &GPIO_Init_Structure);

