STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP215F-DK/stm32mp215f_disco_lcd.c
  /* ('A',  7, AF10) LCD_B5 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_7;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF10_LCD;
  HAL_GPIO_Init(GPIOA, &GPIO_Init_Structure);

  /* ('F',  5, AF13)  LCD_B6 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_5;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOF, &GPIO_Init_Structure);

  /* ('I',  4, AF13) LCD_B7 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_4;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOI, &GPIO_Init_Structure);

  /* GIC configuration for LTDC interrupt */
  IRQ_SetPriority(LTDC_IRQn, 0);
  IRQ_Enable(LTDC_IRQn);

  /* Enable LTDC reset state */
  __HAL_RCC_LTDC_FORCE_RESET();

  /* Release LTDC from reset state */
  __HAL_RCC_LTDC_RELEASE_RESET();

}

/**
  * @brief  DeInitializes BSP_LCD MSP.
  * @param  hltdc: LTDC handle
  * @param  Params
  * @retval None
  */
__weak void BSP_LCD_MspDeInit(LTDC_HandleTypeDef *hltdc, void *Params)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Params);

  /* Disable LTDC block */
  __HAL_LTDC_DISABLE(hltdc);

  /*
   * CLK  ----> F12  (AF13)
   * HSYNC----> G2  (AF13)
   * VSYNC----> I6  (AF13)
   * DE   ----> C5  (AF14)
   *
   * R2   ----> C11  (AF13)
   * R3   ----> A1 (AF11)
   * R4   ----> B15 (AF13)
   * R5   ----> G5  (AF13)
   * R6   ----> A10 (AF12)
   * R7   ----> G7  (AF13)
   *
   * G2   ----> G8  (AF13)
   * G3   ----> G9  (AF13)
   * G4   ----> G10  (AF13)
   * G5   ----> G11  (AF13)
   * G6   ----> G12  (AF13)
   * G7   ----> C0 (AF13)
   *
   * B2   ----> G15 (AF13)
   * B3   ----> I0  (AF13)
   * B4   ----> I1  (AF13)
   * B5   ----> A7  (AF10)
   * B6   ----> F5  (AF13)
   * B7   ----> I4  (AF13)
   * */

  /* ('F', 12, AF13) LCD_CLK */
  HAL_GPIO_DeInit(GPIOF, GPIO_PIN_12);

  /* ('G', 2, AF13) LCD_HSYNC */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_2);

  /* ('I',  6, AF13) LCD_VSYNC */
  HAL_GPIO_DeInit(GPIOI, GPIO_PIN_6);

  /* ('C',  5, AF14) LCD_DE */
  HAL_GPIO_DeInit(GPIOC, GPIO_PIN_5);

  /* ('C',  11, AF13) LCD_R2 */
  HAL_GPIO_DeInit(GPIOC, GPIO_PIN_11);

  /* ('A', 1, AF11) LCD_R3 */
  HAL_GPIO_DeInit(GPIOA, GPIO_PIN_1);

  /* ('B',  15, AF13) LCD_R4 */
  HAL_GPIO_DeInit(GPIOB, GPIO_PIN_15);

  /* ('G',  5, AF13) LCD_R5 */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_5);

  /* ('A',  10, AF12) LCD_R6 */
  HAL_GPIO_DeInit(GPIOA, GPIO_PIN_10);

  /* ('G',  7, AF13) LCD_R7 */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_7);

  /* ('G', 8, AF13) LCD_G2 */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_8);

  /* ('G',  9, AF13) LCD_G3 */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_9);

  /* ('G',  10, AF13) LCD_G4 */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_10);

  /* ('G',  11, AF13) LCD_G5 */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_11);

  /* ('G',  12, AF13) LCD_G6 */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_12);

  /* ('C', 0, AF13) LCD_G7 */
  HAL_GPIO_DeInit(GPIOC, GPIO_PIN_0);

  /* ('G',  15, AF13) LCD_B2 */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_15);

  /* ('I',  0, AF13) LCD_B3 */
  HAL_GPIO_DeInit(GPIOF, GPIO_PIN_0);

  /* ('I',  1, AF13) LCD_B4 */
  HAL_GPIO_DeInit(GPIOI, GPIO_PIN_1);

  /* ('A',  7, AF10) LCD_B5 */
  HAL_GPIO_DeInit(GPIOA, GPIO_PIN_7);

  /* ('F',  5, AF13)  LCD_B6 */
  HAL_GPIO_DeInit(GPIOF, GPIO_PIN_5);

  /* ('I',  4, AF13) LCD_B7 */
  HAL_GPIO_DeInit(GPIOI, GPIO_PIN_4);

  /* Disable IRQ */
  IRQ_Disable(LTDC_IRQn);

  /* Disable LTDC clock */
  __HAL_RCC_LTDC_CLK_DISABLE();

}

/**
  * @brief  Clock Config.
  * @param  hltdc: LTDC handle
  * @param  Params
  * @note   This API is called by BSP_LCD_Init()
  *         Being __weak it can be overwritten by the application
  * @retval None
  */
__weak void BSP_LCD_ClockConfig(LTDC_HandleTypeDef *hltdc, void *Params)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hltdc);
  UNUSED(Params);


}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
